---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kevincao/Desktop/MATH76/Trading Project/regressions.log
  log type:  text
 opened on:  24 May 2023, 13:40:11

. 
. use trading.dta, clear

. 
. gen ln_eigen = ln(eigencentrality)
(162 missing values generated)

. gen ln_e_usd = ln(e_usd)
(162 missing values generated)

. gen ln_interestrate = ln(interestrate)
(3,771 missing values generated)

. gen ln_gdpgrowth = ln(gdpgrowth)
(892 missing values generated)

. 
. 
. xtset countryid year

Panel variable: countryid (unbalanced)
 Time variable: year, 1984 to 2016, but with a gap
         Delta: 1 unit

. 
. 
. // regression 1: % change in exchange rate from % change in eigen, interest rate, and gdp growth
. 
. // year fixed effects (option but there is some justification --> all countries are affected by global economic fluctuati
> ons)
. 
. // in spite of null results for ln_eigen, this is good because it debunks modern political argument that american "trade 
> weakness" is weakening our currency
. xtreg ln_e_usd ln_eigen ln_interestrate gdpgrowth i.year, fe cluster(countryid) 

Fixed-effects (within) regression               Number of obs     =      1,642
Group variable: countryid                       Number of groups  =         55

R-squared:                                      Obs per group:
     Within  = 0.1753                                         min =          2
     Between = 0.0041                                         avg =       29.9
     Overall = 0.0508                                         max =         33

                                                F(35,54)          =      41.13
corr(u_i, Xb) = -0.0151                         Prob > F          =     0.0000

                                (Std. err. adjusted for 55 clusters in countryid)
---------------------------------------------------------------------------------
                |               Robust
       ln_e_usd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
       ln_eigen |   .0798518   .2067055     0.39   0.701    -.3345678    .4942714
ln_interestrate |   .1160977   .1109365     1.05   0.300    -.1063166     .338512
      gdpgrowth |   .0179409   .0106487     1.68   0.098    -.0034084    .0392902
                |
           year |
          1985  |   .2149934   .0739135     2.91   0.005     .0668058    .3631809
          1986  |   .2086209   .0935474     2.23   0.030     .0210696    .3961721
          1987  |   .2650842   .1315682     2.01   0.049     .0013059    .5288625
          1988  |   .4095057   .2039676     2.01   0.050     .0005752    .8184362
          1989  |   .7125484   .3322302     2.14   0.036      .046467     1.37863
          1990  |   .9393668    .477958     1.97   0.055    -.0188813    1.897615
          1991  |   1.248019   .5280298     2.36   0.022     .1893831    2.306655
          1992  |   1.214056   .5791852     2.10   0.041     .0528594    2.375252
          1993  |   1.558643    .604765     2.58   0.013     .3461621    2.771124
          1994  |   1.643873   .6434107     2.55   0.013     .3539123    2.933834
          1995  |   1.646447    .669064     2.46   0.017     .3050542    2.987839
          1996  |   1.706865   .6696068     2.55   0.014     .3643841    3.049346
          1997  |   1.830177   .6632263     2.76   0.008     .5004882    3.159865
          1998  |    1.96219   .6779774     2.89   0.005     .6029275    3.321453
          1999  |   2.116249   .6562829     3.22   0.002     .8004813    3.432017
          2000  |   2.161651   .6529956     3.31   0.002     .8524742    3.470829
          2001  |   2.276063   .6665621     3.41   0.001      .939686    3.612439
          2002  |   2.300104   .6731477     3.42   0.001     .9505242    3.649684
          2003  |   2.204178   .6721768     3.28   0.002     .8565448    3.551811
          2004  |   2.126138   .6682979     3.18   0.002     .7862817    3.465995
          2005  |   2.112758   .6658828     3.17   0.002     .7777435    3.447773
          2006  |   2.063474   .6741733     3.06   0.003     .7118378     3.41511
          2007  |   1.963977   .6833063     2.87   0.006     .5940302    3.333923
          2008  |   1.980943   .6919059     2.86   0.006     .5937556    3.368131
          2009  |   2.265863   .6856686     3.30   0.002     .8911807    3.640546
          2010  |   2.165058    .652217     3.32   0.002     .8574417    3.472674
          2011  |   2.103213   .6633465     3.17   0.003     .7732829    3.433142
          2012  |   2.217723    .661958     3.35   0.001     .8905772    3.544869
          2013  |    2.23842   .6691716     3.35   0.002     .8968117    3.580028
          2014  |   2.332214   .6650686     3.51   0.001     .9988317    3.665596
          2015  |   2.581032   .6652009     3.88   0.000     1.247385     3.91468
          2016  |   2.701797   .6837239     3.95   0.000     1.331013    4.072581
                |
          _cons |  -.4948475   1.084645    -0.46   0.650     -2.66943    1.679735
----------------+----------------------------------------------------------------
        sigma_u |  2.3031533
        sigma_e |  1.4252673
            rho |  .72308969   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. // no interest rate 
. xtreg ln_e_usd ln_eigen gdpgrowth i.year, fe cluster(countryid)

Fixed-effects (within) regression               Number of obs     =      5,413
Group variable: countryid                       Number of groups  =        178

R-squared:                                      Obs per group:
     Within  = 0.2225                                         min =          2
     Between = 0.0553                                         avg =       30.4
     Overall = 0.0120                                         max =         33

                                                F(34,177)         =       9.89
corr(u_i, Xb) = -0.1665                         Prob > F          =     0.0000

                            (Std. err. adjusted for 178 clusters in countryid)
------------------------------------------------------------------------------
             |               Robust
    ln_e_usd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ln_eigen |    .134215   .0788454     1.70   0.090    -.0213831    .2898131
   gdpgrowth |   .0169463   .0070732     2.40   0.018     .0029877     .030905
             |
        year |
       1985  |   .1629914   .0449029     3.63   0.000     .0743774    .2516054
       1986  |   .2225838   .0608985     3.65   0.000     .1024032    .3427644
       1987  |   .3282765   .0814443     4.03   0.000     .1675497    .4890033
       1988  |   .5172516   .1292725     4.00   0.000     .2621379    .7723653
       1989  |    .770269   .1738965     4.43   0.000     .4270917    1.113446
       1990  |    .877376   .2171115     4.04   0.000     .4489157    1.305836
       1991  |   1.119825    .244925     4.57   0.000     .6364762    1.603174
       1992  |   1.138234   .2693916     4.23   0.000      .606601    1.669867
       1993  |   1.382102   .2809334     4.92   0.000     .8276923    1.936512
       1994  |   1.604085   .2962451     5.41   0.000     1.019458    2.188712
       1995  |   1.672943   .3019361     5.54   0.000     1.077085    2.268801
       1996  |   1.754461   .3100045     5.66   0.000      1.14268    2.366241
       1997  |   1.863015   .3125931     5.96   0.000     1.246126    2.479905
       1998  |   1.995635   .3197622     6.24   0.000     1.364598    2.626672
       1999  |   2.123473   .3302607     6.43   0.000     1.471718    2.775229
       2000  |   2.215423   .3316246     6.68   0.000     1.560976     2.86987
       2001  |   2.297015   .3350042     6.86   0.000     1.635899    2.958132
       2002  |   2.346079   .3393241     6.91   0.000     1.676437     3.01572
       2003  |    2.29791   .3392284     6.77   0.000     1.628458    2.967363
       2004  |   2.242247   .3375574     6.64   0.000     1.576092    2.908402
       2005  |    2.25908   .3390971     6.66   0.000     1.589886    2.928273
       2006  |   2.257134   .3393396     6.65   0.000     1.587462    2.926806
       2007  |   2.239303   .3442215     6.51   0.000     1.559996    2.918609
       2008  |   2.322744   .3730445     6.23   0.000     1.586557    3.058931
       2009  |    2.32686   .3477545     6.69   0.000     1.640581    3.013138
       2010  |   2.270437   .3392739     6.69   0.000     1.600894    2.939979
       2011  |   2.251123   .3383829     6.65   0.000     1.583339    2.918907
       2012  |   2.350068   .3421885     6.87   0.000     1.674773    3.025362
       2013  |   2.370377   .3419626     6.93   0.000     1.695528    3.045226
       2014  |   2.415864   .3470381     6.96   0.000     1.730999    3.100729
       2015  |   2.556528   .3531809     7.24   0.000     1.859541    3.253516
       2016  |   2.623309   .3568141     7.35   0.000     1.919152    3.327467
             |
       _cons |   1.345196   .4599298     2.92   0.004     .4375444    2.252848
-------------+----------------------------------------------------------------
     sigma_u |  2.8768431
     sigma_e |  1.4251205
         rho |  .80295623   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. // wait gdpgrowth is not a part of the UIP model
. xtreg ln_e_usd ln_eigen ln_interestrate i.year, fe cluster(countryid)

Fixed-effects (within) regression               Number of obs     =      1,642
Group variable: countryid                       Number of groups  =         55

R-squared:                                      Obs per group:
     Within  = 0.1725                                         min =          2
     Between = 0.0008                                         avg =       29.9
     Overall = 0.0457                                         max =         33

                                                F(34,54)          =      75.45
corr(u_i, Xb) = -0.0294                         Prob > F          =     0.0000

                                (Std. err. adjusted for 55 clusters in countryid)
---------------------------------------------------------------------------------
                |               Robust
       ln_e_usd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
       ln_eigen |   .1047623   .2067781     0.51   0.614    -.3098028    .5193275
ln_interestrate |   .1139435   .1114768     1.02   0.311    -.1095541     .337441
                |
           year |
          1985  |   .1992976   .0743503     2.68   0.010     .0502343    .3483609
          1986  |   .2276657   .0940523     2.42   0.019     .0391021    .4162292
          1987  |   .2699462   .1340765     2.01   0.049     .0011391    .5387534
          1988  |   .4228904    .199865     2.12   0.039     .0221852    .8235955
          1989  |   .7023791   .3253524     2.16   0.035     .0500868    1.354671
          1990  |   .9793008   .4781605     2.05   0.045     .0206467    1.937955
          1991  |   1.171708   .5182401     2.26   0.028     .1326989    2.210717
          1992  |   1.212899   .5800991     2.09   0.041     .0498708    2.375928
          1993  |   1.559007   .6078995     2.56   0.013     .3402424    2.777772
          1994  |   1.654805   .6467973     2.56   0.013      .358055    2.951556
          1995  |   1.651087   .6695826     2.47   0.017      .308655    2.993519
          1996  |   1.713746   .6706875     2.56   0.013     .3690984    3.058393
          1997  |   1.846331   .6658628     2.77   0.008     .5113568    3.181306
          1998  |   1.945088   .6750426     2.88   0.006     .5917092    3.298467
          1999  |   2.105863   .6519283     3.23   0.002     .7988255      3.4129
          2000  |   2.190607   .6552451     3.34   0.002     .8769199    3.504295
          2001  |   2.254327   .6618714     3.41   0.001     .9273547    3.581299
          2002  |   2.284717   .6699352     3.41   0.001     .9415775    3.627856
          2003  |   2.203738   .6720484     3.28   0.002     .8563615    3.551114
          2004  |   2.148469   .6727107     3.19   0.002      .799765    3.497173
          2005  |   2.125206   .6683953     3.18   0.002      .785154    3.465258
          2006  |   2.088613   .6783978     3.08   0.003     .7285071    3.448719
          2007  |   1.989317   .6878982     2.89   0.006      .610164     3.36847
          2008  |   1.953553   .6894956     2.83   0.006      .571197    3.335908
          2009  |    2.14273   .6591431     3.25   0.002     .8212278    3.464233
          2010  |   2.157421   .6518459     3.31   0.002     .8505486    3.464293
          2011  |     2.0889   .6618558     3.16   0.003     .7619591    3.415841
          2012  |   2.181243   .6542811     3.33   0.002     .8694885    3.492998
          2013  |    2.20619   .6623444     3.33   0.002     .8782694     3.53411
          2014  |   2.314707   .6581022     3.52   0.001     .9952919    3.634123
          2015  |   2.570066   .6606085     3.89   0.000     1.245625    3.894506
          2016  |   2.677042   .6748403     3.97   0.000     1.324068    4.030015
                |
          _cons |  -.3336076   1.054095    -0.32   0.753     -2.44694    1.779725
----------------+----------------------------------------------------------------
        sigma_u |  2.3111662
        sigma_e |  1.4271687
            rho |  .72394583   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. // 1:1
. xtreg ln_e_usd ln_eigen i.year, fe cluster(countryid)

Fixed-effects (within) regression               Number of obs     =      5,413
Group variable: countryid                       Number of groups  =        178

R-squared:                                      Obs per group:
     Within  = 0.2184                                         min =          2
     Between = 0.0659                                         avg =       30.4
     Overall = 0.0073                                         max =         33

                                                F(33,177)         =      10.44
corr(u_i, Xb) = -0.1960                         Prob > F          =     0.0000

                            (Std. err. adjusted for 178 clusters in countryid)
------------------------------------------------------------------------------
             |               Robust
    ln_e_usd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ln_eigen |     .15005   .0838148     1.79   0.075     -.015355     .315455
             |
        year |
       1985  |   .1604362   .0432229     3.71   0.000     .0751376    .2457347
       1986  |    .226673   .0606622     3.74   0.000     .1069586    .3463873
       1987  |   .3307543    .081784     4.04   0.000     .1693572    .4921514
       1988  |   .5273682   .1284858     4.10   0.000     .2738069    .7809295
       1989  |   .7492416   .1703707     4.40   0.000     .4130223    1.085461
       1990  |   .8995309   .2186519     4.11   0.000     .4680307    1.331031
       1991  |     1.1004   .2435446     4.52   0.000     .6197756    1.581025
       1992  |   1.132169    .269798     4.20   0.000     .5997343    1.664604
       1993  |   1.374818   .2813483     4.89   0.000     .8195891    1.930047
       1994  |   1.589872   .2959774     5.37   0.000     1.005773    2.173971
       1995  |   1.686121   .3049989     5.53   0.000     1.084218    2.288023
       1996  |   1.781243   .3148594     5.66   0.000     1.159881    2.402604
       1997  |   1.898304   .3172467     5.98   0.000     1.272231    2.524377
       1998  |   2.001913   .3205845     6.24   0.000     1.369254    2.634573
       1999  |    2.12662   .3308255     6.43   0.000      1.47375     2.77949
       2000  |   2.237431   .3351894     6.68   0.000     1.575949    2.898913
       2001  |   2.301108   .3360479     6.85   0.000     1.637932    2.964284
       2002  |   2.349598    .341239     6.89   0.000     1.676177    3.023018
       2003  |   2.312809   .3420588     6.76   0.000     1.637771    2.987848
       2004  |    2.28904   .3437366     6.66   0.000     1.610691     2.96739
       2005  |   2.292117   .3440832     6.66   0.000     1.613084    2.971151
       2006  |   2.304906   .3450521     6.68   0.000      1.62396    2.985851
       2007  |   2.284573   .3493706     6.54   0.000     1.595105    2.974041
       2008  |   2.332449   .3742409     6.23   0.000     1.593901    3.070997
       2009  |   2.269771   .3403485     6.67   0.000     1.598107    2.941434
       2010  |   2.289245   .3431743     6.67   0.000     1.612005    2.966485
       2011  |   2.260046   .3410115     6.63   0.000     1.587074    2.933017
       2012  |   2.352647   .3432648     6.85   0.000     1.675229    3.030065
       2013  |   2.369182   .3432072     6.90   0.000     1.691878    3.046487
       2014  |   2.419166   .3479907     6.95   0.000     1.732421    3.105911
       2015  |   2.551987   .3525542     7.24   0.000     1.856236    3.247738
       2016  |    2.62285   .3569942     7.35   0.000     1.918337    3.327363
             |
       _cons |   1.499761   .4935682     3.04   0.003     .5257252    2.473797
-------------+----------------------------------------------------------------
     sigma_u |  2.8994068
     sigma_e |   1.428736
         rho |   .8046213   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. 
. 
. // regression 2: % change in growth <- % change in eigen 
. 
. // no controls
. xtreg gdpgrowth ln_eigen i.year, fe cluster(countryid)

Fixed-effects (within) regression               Number of obs     =      5,413
Group variable: countryid                       Number of groups  =        178

R-squared:                                      Obs per group:
     Within  = 0.0513                                         min =          2
     Between = 0.0002                                         avg =       30.4
     Overall = 0.0099                                         max =         33

                                                F(33,177)         =      10.35
corr(u_i, Xb) = -0.6764                         Prob > F          =     0.0000

                            (Std. err. adjusted for 178 clusters in countryid)
------------------------------------------------------------------------------
             |               Robust
   gdpgrowth | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ln_eigen |    .934423   .2669208     3.50   0.001     .4076662     1.46118
             |
        year |
       1985  |  -.1507857   .4881622    -0.31   0.758    -1.114153    .8125815
       1986  |   .2413011   .4782128     0.50   0.614    -.7024313    1.185034
       1987  |   .1462132   .5964882     0.25   0.807    -1.030931    1.323357
       1988  |   .5969735   .6065314     0.98   0.326    -.5999903    1.793937
       1989  |  -1.240825   .8022675    -1.55   0.124    -2.824065    .3424157
       1990  |   1.307359   .8926289     1.46   0.145    -.4542061    3.068924
       1991  |  -1.146256   1.058552    -1.08   0.280    -3.235263    .9427501
       1992  |  -.3578801   .8315538    -0.43   0.667    -1.998916    1.283156
       1993  |  -.4298575   .7365118    -0.58   0.560    -1.883332    1.023617
       1994  |  -.8386892   .6621891    -1.27   0.207    -2.145491    .4681126
       1995  |   .7776272    .592261     1.31   0.191    -.3911746    1.946429
       1996  |   1.580386   .6687325     2.36   0.019     .2606715    2.900101
       1997  |   2.082368   1.063577     1.96   0.052    -.0165557    4.181291
       1998  |   .3704791   .6570283     0.56   0.574    -.9261381    1.667096
       1999  |   .1856786   .5394893     0.34   0.731    -.8789804    1.250338
       2000  |   1.298696   .4931669     2.63   0.009     .3254521     2.27194
       2001  |   .2415008   .6486071     0.37   0.710    -1.038498    1.521499
       2002  |   .2076688   .5709455     0.36   0.716    -.9190678    1.334405
       2003  |   .8791869   .6421993     1.37   0.173    -.3881659     2.14654
       2004  |   2.761261   .6382277     4.33   0.000     1.501746    4.020776
       2005  |   1.949545   .5306417     3.67   0.000     .9023459    2.996743
       2006  |   2.819018   .5547963     5.08   0.000     1.724151    3.913885
       2007  |   2.671367   .4918164     5.43   0.000     1.700788    3.641945
       2008  |   .5726948   .5345093     1.07   0.285    -.4821364    1.627526
       2009  |  -3.368831   .6049772    -5.57   0.000    -4.562727   -2.174934
       2010  |   1.109886   .5516036     2.01   0.046     .0213202    2.198452
       2011  |   .5265477   .6111621     0.86   0.390    -.6795544     1.73265
       2012  |   .1522186   .6864094     0.22   0.825    -1.202381    1.506818
       2013  |  -.0704922   .5899841    -0.12   0.905    -1.234801    1.093816
       2014  |   .1948678   .5212789     0.37   0.709    -.8338538    1.223589
       2015  |  -.2679948   .5251271    -0.51   0.610    -1.304311     .768321
       2016  |  -.0271184   .4752522    -0.06   0.955    -.9650083    .9107715
             |
       _cons |   9.120824   1.701138     5.36   0.000     5.763702    12.47795
-------------+----------------------------------------------------------------
     sigma_u |  3.3292177
     sigma_e |    6.10649
         rho |  .22913012   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. // exchange rate control
. xtreg gdpgrowth ln_eigen ln_e_usd i.year, fe cluster(countryid)

Fixed-effects (within) regression               Number of obs     =      5,413
Group variable: countryid                       Number of groups  =        178

R-squared:                                      Obs per group:
     Within  = 0.0563                                         min =          2
     Between = 0.0050                                         avg =       30.4
     Overall = 0.0192                                         max =         33

                                                F(34,177)         =      10.23
corr(u_i, Xb) = -0.6126                         Prob > F          =     0.0000

                            (Std. err. adjusted for 178 clusters in countryid)
------------------------------------------------------------------------------
             |               Robust
   gdpgrowth | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ln_eigen |   .8879724   .2622394     3.39   0.001     .3704542    1.405491
    ln_e_usd |   .3095675   .1265552     2.45   0.015     .0598161    .5593188
             |
        year |
       1985  |  -.2004515   .4919565    -0.41   0.684    -1.171307    .7704037
       1986  |   .1711305    .481586     0.36   0.723    -.7792589     1.12152
       1987  |   .0438225   .5962418     0.07   0.941    -1.132835     1.22048
       1988  |   .4337175   .6155179     0.70   0.482    -.7809807    1.648416
       1989  |  -1.472766   .8142521    -1.81   0.072    -3.079657    .1341259
       1990  |   1.028893   .9021741     1.14   0.256    -.7515087    2.809295
       1991  |  -1.486905   1.070062    -1.39   0.166    -3.598626    .6248165
       1992  |  -.7083629   .8502374    -0.83   0.406     -2.38627    .9695442
       1993  |  -.8554565   .7616012    -1.12   0.263    -2.358444    .6475309
       1994  |  -1.330862   .7197136    -1.85   0.066    -2.751186    .0894621
       1995  |   .2556591   .6409627     0.40   0.690    -1.009253    1.520572
       1996  |   1.028972   .7254132     1.42   0.158    -.4026003    2.460544
       1997  |   1.494715   1.087632     1.37   0.171    -.6516812     3.64111
       1998  |  -.2492482   .7034942    -0.35   0.724    -1.637564    1.139067
       1999  |  -.4726538   .5965329    -0.79   0.429    -1.649886    .7045784
       2000  |     .60606   .5530085     1.10   0.275    -.4852786    1.697399
       2001  |  -.4708474   .6964314    -0.68   0.500    -1.845225    .9035302
       2002  |  -.5196904   .6013583    -0.86   0.389    -1.706445    .6670645
       2003  |   .1632163   .6519114     0.25   0.803    -1.123303    1.449736
       2004  |   2.052649   .6709814     3.06   0.003     .7284959    3.376802
       2005  |    1.23998   .5689066     2.18   0.031     .1172668    2.362692
       2006  |   2.105494   .5956922     3.53   0.001      .929921    3.281067
       2007  |   1.964137   .5276763     3.72   0.000     .9227905    3.005484
       2008  |  -.1493556    .546863    -0.27   0.785    -1.228566    .9298552
       2009  |  -4.071478    .667376    -6.10   0.000    -5.388516    -2.75444
       2010  |   .4012104   .6196736     0.65   0.518     -.821689     1.62411
       2011  |   -.173089   .6523743    -0.27   0.791    -1.460522    1.114344
       2012  |  -.5760844   .7392106    -0.78   0.437    -2.034885     .882716
       2013  |  -.8039141   .6418397    -1.25   0.212    -2.070557     .462729
       2014  |  -.5540274   .5944514    -0.93   0.353    -1.727152     .619097
       2015  |  -1.058007   .6137114    -1.72   0.086     -2.26914    .1531262
       2016  |  -.8390674    .568144    -1.48   0.141    -1.960275    .2821405
             |
       _cons |   8.656547   1.689445     5.12   0.000       5.3225    11.99059
-------------+----------------------------------------------------------------
     sigma_u |  3.0741327
     sigma_e |   6.091037
         rho |  .20300932   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. // interest rate control
. xtreg gdpgrowth ln_eigen ln_interestrate i.year, fe cluster(countryid)

Fixed-effects (within) regression               Number of obs     =      1,642
Group variable: countryid                       Number of groups  =         55

R-squared:                                      Obs per group:
     Within  = 0.1280                                         min =          2
     Between = 0.0030                                         avg =       29.9
     Overall = 0.0334                                         max =         33

                                                F(34,54)          =      26.10
corr(u_i, Xb) = -0.6805                         Prob > F          =     0.0000

                                (Std. err. adjusted for 55 clusters in countryid)
---------------------------------------------------------------------------------
                |               Robust
      gdpgrowth | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
       ln_eigen |   1.388478   .4620431     3.01   0.004     .4621378    2.314819
ln_interestrate |  -.1200745   .1601489    -0.75   0.457    -.4411536    .2010046
                |
           year |
          1985  |  -.8748592   .4740962    -1.85   0.070    -1.825365    .0756463
          1986  |   1.061529   .8325467     1.28   0.208    -.6076268    2.730685
          1987  |   .2710027   .7324654     0.37   0.713    -1.197502    1.739507
          1988  |   .7460423    .855162     0.87   0.387    -.9684542    2.460539
          1989  |   -.566822   .8082053    -0.70   0.486    -2.187176    1.053532
          1990  |    2.22586   2.172869     1.02   0.310    -2.130479      6.5822
          1991  |   -4.25348    2.19034    -1.94   0.057    -8.644847    .1378863
          1992  |  -.0644578    1.29754    -0.05   0.961     -2.66587    2.536954
          1993  |   .0203149   1.166201     0.02   0.986    -2.317778    2.358408
          1994  |   .6093585   .6878601     0.89   0.380     -.769718    1.988435
          1995  |   .2586531    .678218     0.38   0.704    -1.101092    1.618398
          1996  |   .3835426   .6906707     0.56   0.581    -1.001169    1.768254
          1997  |   .9004239   .7185968     1.25   0.216    -.5402758    2.341124
          1998  |   -.953255   .9163378    -1.04   0.303    -2.790402    .8838917
          1999  |  -.5789189   .6828784    -0.85   0.400    -1.948008    .7901699
          2000  |   1.613954    .703368     2.29   0.026     .2037865    3.024122
          2001  |  -1.211509   .6695594    -1.81   0.076    -2.553895    .1308764
          2002  |  -.8576693   .6148398    -1.39   0.169    -2.090349    .3750102
          2003  |  -.0245581   .6927714    -0.04   0.972    -1.413481    1.364365
          2004  |   1.244668   .6372916     1.95   0.056    -.0330244    2.522361
          2005  |   .6938142   .6120038     1.13   0.262    -.5331796    1.920808
          2006  |   1.401209   .6135431     2.28   0.026     .1711295    2.631289
          2007  |   1.412411    .632256     2.23   0.030      .144814    2.680008
          2008  |  -1.526724   .7092908    -2.15   0.036    -2.948767   -.1046819
          2009  |  -6.863264   .8376134    -8.19   0.000    -8.542578    -5.18395
          2010  |  -.4256749   .6687279    -0.64   0.527    -1.766394    .9150439
          2011  |  -.7977578   .6951516    -1.15   0.256    -2.191453    .5959373
          2012  |  -2.033335   .7128686    -2.85   0.006    -3.462551   -.6041196
          2013  |   -1.79646   .7362619    -2.44   0.018    -3.272576   -.3203434
          2014  |  -.9757986   .8599687    -1.13   0.262    -2.699932    .7483348
          2015  |  -.6112555   .9194335    -0.66   0.509    -2.454609    1.232098
          2016  |  -1.379836   .9191213    -1.50   0.139    -3.222563    .4628913
                |
          _cons |   8.987275   1.802182     4.99   0.000     5.374117    12.60043
----------------+----------------------------------------------------------------
        sigma_u |  2.9958925
        sigma_e |  4.5731391
            rho |  .30029041   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. // all controls
. xtreg gdpgrowth ln_eigen ln_e_usd ln_interestrate i.year, fe cluster(countryid)

Fixed-effects (within) regression               Number of obs     =      1,642
Group variable: countryid                       Number of groups  =         55

R-squared:                                      Obs per group:
     Within  = 0.1309                                         min =          2
     Between = 0.0002                                         avg =       29.9
     Overall = 0.0389                                         max =         33

                                                F(35,54)          =      30.20
corr(u_i, Xb) = -0.6763                         Prob > F          =     0.0000

                                (Std. err. adjusted for 55 clusters in countryid)
---------------------------------------------------------------------------------
                |               Robust
      gdpgrowth | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
       ln_eigen |    1.36918   .4531004     3.02   0.004      .460768    2.277591
       ln_e_usd |    .184214   .1293275     1.42   0.160    -.0750719       .4435
ln_interestrate |  -.1410645   .1537765    -0.92   0.363    -.4493678    .1672388
                |
           year |
          1985  |  -.9115726   .4803257    -1.90   0.063    -1.874568    .0514225
          1986  |    1.01959   .8301661     1.23   0.225    -.6447931    2.683972
          1987  |   .2212748   .7253822     0.31   0.762    -1.233029    1.675579
          1988  |     .66814   .8658377     0.77   0.444     -1.06776     2.40404
          1989  |    -.69621   .8442489    -0.82   0.413    -2.388827    .9964071
          1990  |   2.045459   2.181113     0.94   0.353    -2.327409    6.418327
          1991  |  -4.469325   2.192348    -2.04   0.046    -8.864718   -.0739321
          1992  |  -.2878909   1.305355    -0.22   0.826    -2.904971    2.329189
          1993  |  -.2668761   1.171989    -0.23   0.821    -2.616573    2.082821
          1994  |   .3045201   .7119673     0.43   0.671    -1.122888    1.731929
          1995  |  -.0455003   .7132316    -0.06   0.949    -1.475444    1.384443
          1996  |   .0678466   .7133593     0.10   0.925    -1.362353    1.498046
          1997  |   .5603038   .7441048     0.75   0.455    -.9315364    2.052144
          1998  |  -1.311567   .9625374    -1.36   0.179    -3.241339    .6182038
          1999  |  -.9668483   .7340208    -1.32   0.193    -2.438471    .5047747
          2000  |   1.210414   .7459024     1.62   0.110    -.2850305    2.705858
          2001  |  -1.626788   .7136858    -2.28   0.027    -3.057642   -.1959342
          2002  |  -1.278546   .6843865    -1.87   0.067    -2.650658    .0935661
          2003  |  -.4305174       .702    -0.61   0.542    -1.837943    .9769078
          2004  |   .8488902   .6502569     1.31   0.197    -.4547963    2.152577
          2005  |   .3023215    .625058     0.48   0.631    -.9508443    1.555487
          2006  |   1.016458   .6185355     1.64   0.106    -.2236315    2.256547
          2007  |   1.045951    .639583     1.64   0.108    -.2363358    2.328238
          2008  |  -1.886596    .719285    -2.62   0.011    -3.328676   -.4445166
          2009  |  -7.257985   .9082845    -7.99   0.000    -9.078986   -5.436984
          2010  |  -.8231021   .7124308    -1.16   0.253     -2.25144    .6052357
          2011  |  -1.182562   .7167532    -1.65   0.105    -2.619566    .2544412
          2012  |  -2.435151   .7506426    -3.24   0.002    -3.940099   -.9302029
          2013  |  -2.202871   .7872388    -2.80   0.007    -3.781189   -.6245519
          2014  |    -1.4022    .921073    -1.52   0.134     -3.24884    .4444401
          2015  |  -1.084698   .9496214    -1.14   0.258    -2.988574    .8191787
          2016  |  -1.872984   .9506423    -1.97   0.054    -3.778908    .0329386
                |
          _cons |    9.04873   1.820867     4.97   0.000     5.398112    12.69935
----------------+----------------------------------------------------------------
        sigma_u |   2.957588
        sigma_e |  4.5670465
            rho |  .29546549   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/kevincao/Desktop/MATH76/Trading Project/regressions.log
  log type:  text
 closed on:  24 May 2023, 13:40:11
---------------------------------------------------------------------------------------------------------------------------
